/*
 * Таймкоды:
00:00 ➝ Введение.
00:55 ➝ Отличие процедурного подхода от объектно-ориентированного.
02:10 ➝ Классы. Объекты. Свойства. Методы. Конструктор.
04:40 ➝ Инкапсуляция и сокрытие. Модификаторы доступа.
11:50 ➝ Наследование.
16:40 ➝ Полиморфизм. Параметрический и ad-hoc
23:00 ➝ Агрегация и композиция.
26:35 ➝ Интерфейсы и абстрактные классы.
32:30 ➝ Внедрение зависимостей. Dependency injection
37:10 ➝ Паттерн singleton

 * Парадигма ООП:
Объекты
Классы
Инкапсуляция
Полиморфизм
Наследование
Композиция
Dependency Injection
Интерфейсы
*/
